.emacs.d/init.el

(use-package dap-mode
  ;; Uncomment the config below if you want all UI panes to be hidden by default!
  ;; :custom
  ;; (lsp-enable-dap-auto-configure nil)
  ;; :config
  ;; (dap-ui-mode 1)
  :commands dap-debug
  :config
  ;; Set up Node debugging
  (require 'dap-node)
  (dap-node-setup) ;; Automatically installs Node debug adapter if needed

  ;; Bind `C-c l d` to `dap-hydra` for easy access
  (general-define-key
    :keymaps 'lsp-mode-map
    :prefix lsp-keymap-prefix
    "d" '(dap-hydra t :wk "debugger")))

(use-package python-mode
  :ensure t
  ;; :hook (python-mode . lsp-deferred)
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  ;; (python-shell-interpreter "python3")
  ;; (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))


(use-package pyvenv
  :after python-mode
  :config
  (pyvenv-mode 1))
;; (use-package lsp-jedi
;;   :ensure t
;;   :config
;;   (with-eval-after-load "lsp-mode"
;;     (add-to-list 'lsp-disabled-clients 'pyls)
;;     (add-to-list 'lsp-enabled-clients 'jedi)))

(use-package lsp-pyright
  :ensure t
  :after python-mode
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp)))  ; or lsp-deferred
  :config
  (with-eval-after-load "lsp-mode"
    (add-to-list 'lsp-disabled-clients 'pyls)))


(add-hook 'python-mode-hook
          (lambda ()
            (setq flycheck-python-pylint-executable "/usr/bin/pylint")
            (setq flycheck-pylintrc "/home/ural/.config/pylintrc")))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
              ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; optional: this is the evil state that evil-magit will use
;; (setq evil-magit-state 'normal)
;; optional: disable additional bindings for yanking text
;; (setq evil-magit-use-y-for-yank nil)
;; (require 'evil-magit)

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge)

(require 'emms-setup)
(emms-all)
(emms-default-players)

(setq emms-source-file-default-directory "~/Music/My Music")

(setq emms-info-asynchronously nil)
(setq emms-playlist-buffer-name "*Music*")

;; (require 'dashboard)
  ;; (dashboard-setup-startup-hook)
  ;; Or if you use use-package
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)

    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

    ;; Set the title
    (setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
    ;; Set the banner
    (setq dashboard-startup-banner ['logo])
    ;; Value can be
    ;; 'official which displays the official emacs logo
    ;; 'logo which displays an alternative emacs logo
    ;; 1, 2 or 3 which displays one of the text banners
    ;; "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer

    ;; Content is not centered by default. To center, set
    (setq dashboard-center-content t)

    ;; To disable shortcut "jump" indicators for each section, set
    (setq dashboard-show-shortcuts nil)
    (setq dashboard-items '((recents  . 5)
                            ;; (bookmarks . 5)
                            (projects . 5)
                            ;; (agenda . 5)
                            ;; (registers . 5)
                            ))
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      ;; (bookmarks . "book")
                                      ))
    (setq dashboard-set-navigator t)
    ;; Format: "(icon title help action face prefix suffix)"
    ;; (setq dashboard-navigator-buttons
    ;;   `(;; line1
    ;;     ((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
    ;;      "Homepage"
    ;;      "Browse homepage"
    ;;      (lambda (&rest _) (browse-url "homepage")))
    ;;     ("★" "Star" "Show stars" (lambda (&rest _) (show-stars)) warning)
    ;;     ("?" "" "?/h" #'show-help nil "<" ">"))
    ;;      ;; line 2
    ;;     ((,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
    ;;       "Linkedin"
    ;;       ""
    ;;       (lambda (&rest _) (browse-url "homepage")))
    ;;      ("⚑" nil "Show flags" (lambda (&rest _) (message "flag")) error))))

    ;; (setq dashboard-set-init-info t)
    ;; (setq dashboard-init-info "This is an init message!")
    (setq dashboard-set-footer nil)
    ;; (setq dashboard-footer-messages '("Dashboard is pretty cool!"))
    ;; (setq dashboard-footer-icon (all-the-icons-octicon "dashboard"
                                             ;; :height 1.1
                                             ;; :v-adjust -0.05
                                             ;; :face 'font-lock-keyword-face))
    (setq dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name)
;;     (add-to-list 'dashboard-items '(agenda) t)
;;     (setq dashboard-week-agenda t)
;;     (setq dashboard-filter-agenda-entry 'dashboard-no-filter-agenda)


    )
