.emacs.d/init.el

(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  ;;(setq display-line-numbers -1)
  ;; (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))

(when (eq system-type 'windows-nt)
  (setq explicit-shell-file-name "powershell.exe")
  (setq explicit-powershell.exe-args '()))

(defun gunner/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . gunner/configure-eshell)
  :config

  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))

  (eshell-git-prompt-use-theme 'powerline))

;; (defun gunner/around-tracking-add-buffer (original-func buffer &optional faces)
;; (let* ((name (buffer-name buffer))
;; (face (cond ((s-contains? "Himalaya" name) '(all-the-icons-pink))
;; ((s-contains? "Prashant " name) '(all-the-icons-lgreen))
;; ((s-contains? "Sakushal" name) '(all-the-icons-lblue))))
;; (result (apply original-func buffer (list face))))
;; ;; (gunner/update-polybar-telegram)
;; result))

;; ;; (defun gunner/after-tracking-remove-buffer (buffer)
;; ;; (gunner/update-polybar-telegram))

;; (advice-add 'tracking-add-buffer :around #'gunner/around-tracking-add-buffer)
;; (advice-add 'tracking-remove-buffer :after #'gunner/after-tracking-remove-buffer)
;; (advice-remove 'tracking-remove-buffer #'gunner/around-tracking-remove-buffer)

;; ;; Advise exwm-workspace-switch so that we can more reliably clear tracking buffers
;; ;; NOTE: This is a hack and I hate it.  It'd be great to find a better solution.
;; (defun gunner/before-exwm-workspace-switch (frame-or-index &optional force)
;; (when (fboundp 'tracking-remove-visible-buffers)
;; (when (eq exwm-workspace-current-index 0)
;; (tracking-remove-visible-buffers))))

;; (advice-add 'exwm-workspace-switch :before #'gunner/before-exwm-workspace-switch)

(use-package telega
:load-path  "~/telega.el"
:commands (telega)
:defer t
:config
(setq telega-filter-button-width 20))
;; (setq telega-user-use-avatars nil
;; telega-use-tracking-for '(any pin unread)
;; telega-chat-use-markdown-formatting t
;; telega-emoji-use-images t
;; telega-completing-read-function #'ivy-completing-read
;; telega-msg-rainbow-title nil
;; telega-chat-fill-column 75)
(add-hook 'telega-load-hook
(lambda ()
(define-key global-map (kbd "C-c t") telega-prefix-map)))

(use-package tracking
  :defer t
  :config
  (setq tracking-faces-priorities '(all-the-icons-pink
                                    all-the-icons-lgreen
                                    all-the-icons-lblue))
  (setq tracking-frame-behavior nil))

(setq erc-server "irc.libera.chat"
erc-nick "uralgunners"
erc-user-full-name "Ural Shrestha"
erc-track-shorten-start 8
erc-autojoin-channels-alist '(("irc-libera.chat" "#systemcrafters" "##soccers"))
erc-kill-buffer-on-part t
erc-auto-query 'bury)

(use-package mu4e
  :ensure nil
  ;; :load-path "/usr/share/emacs/site-lisp/mu4e/"
  :defer 120 ; Wait until 20 seconds after startup
  :config

  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  (setq mu4e-drafts-folder "/[Gmail]/Drafts")
  (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
  (setq mu4e-refile-folder "/[Gmail]/All Mail")
  (setq mu4e-trash-folder  "/[Gmail]/Trash")


  (setq mu4e-maildir-shortcuts
        '((:maildir "/Inbox"    :key ?i)
          (:maildir "/[Gmail]/Sent Mail" :key ?s)
          (:maildir "/[Gmail]/Trash"     :key ?t)
          (:maildir "/[Gmail]/Drafts"    :key ?d)
          (:maildir "/[Gmail]/All Mail"  :key ?a)))

  (mu4e t))
